app/controllers/upload_controller.rb

  def show_list
    @files = FileUpload.paginate(:page=> params[:page] || 1, :per_page=> 10)
---
SELECT  "file_uploads".* FROM "file_uploads"  LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "file_uploads"